package com.pb.tkachuk.hw6;
/*
Создайте класс Veterinarian (Ветеринар), в котором определите метод void treatAnimal(Animal animal).
Пусть этот метод печатает на экран food и location пришедшего на прием животного.
Объект класса Veterinarian создайте с помощью рефлексии.
 */
public class Veterinarian {
    public void treatAnimal(Animal animal) {
        System.out.println(animal);
    }
}
